STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_PollControl_Client_Coord/STM32_WPAN/App/app_zigbee.c
/**
  ******************************************************************************
  * File Name          : App/app_zigbee.c
  * Description        : Zigbee Application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_zigbee.h"
#include "zigbee_interface.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32wbxx_core_interface_def.h"
#include "zigbee_types.h"
#include "stm32_seq.h"

#include <assert.h>
#include "zcl/zcl.h"
#include "zcl/general/zcl.poll.control.h"

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_STARTUP_FAIL_DELAY               500U
#define SW1_ENDPOINT                                17
#define CHANNEL                                     19
#define HW_TS_SERVER_1MS_NB_TICKS                   (1*1000/CFG_TS_TICK_VAL) /* 1ms */

/* Poll Control specific defines ---------------------------------------------*/
/* Poll Control time related attribute values are in 1/4 of a second */
#define POLL_CONVERT_MS_TO_QS(ms)                          (ms / 250U)
#define POLL_CONVERT_QS_TO_MS(qs)                          (qs * 250U)
#define SERVER_CHECKIN_INTERVAL                            (4*1*60) /* 1min */
#define SERVER_LONG_POLL_INTERVAL                          (4*10)   /* 10s */
#define SERVER_SHORT_POLL_INTERVAL                         (4*1)    /* 1s */
#define SERVER_FAST_POLL_TIMEOUT                           (4*15)   /* 15s */

/* external definition */
enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config);

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_StackLayersInit(void);
static void APP_ZIGBEE_ConfigEndpoints(void);
static void APP_ZIGBEE_NwkForm(void);
static void APP_ZIGBEE_App_Init(void);
static void APP_ZIGBEE_SW1_Process(void);

static void APP_ZIGBEE_Generic_Cmd_Rsp_cb(struct ZbZclCommandRspT *zcl_rsp, void *arg);
static void APP_ZIGBEE_Remote_Write_cb(const ZbZclWriteRspT *writeResp, void *cb_arg);

static void APP_ZIGBEE_PollControl_Client_Init(void);
static void APP_ZIGBEE_PollControl_Client_SetCheckInRspForServers(void);
static void APP_ZIGBEE_PollControl_Client_OperateOnRemoteServer(void);
static enum ZclStatusCodeT APP_ZIGBEE_PollControl_Client_CheckinRsp_cb(struct ZbZclClusterT *clusterPtr,
                                                                       struct zcl_poll_checkin_rsp_t *rsp_info, 
                                                                       struct ZbZclAddrInfoT *srcInfo, void *arg);

static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode);
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void);

static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);

/* Private variables -----------------------------------------------*/
static TL_CmdPacket_t *p_ZIGBEE_otcmdbuffer;
static TL_EvtPacket_t *p_ZIGBEE_notif_M0_to_M4;
static TL_EvtPacket_t *p_ZIGBEE_request_M0_to_M4;
static __IO uint32_t CptReceiveNotifyFromM0 = 0;
static __IO uint32_t CptReceiveRequestFromM0 = 0;

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_ZIGBEE_Config_t ZigbeeConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ZigbeeOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRequestBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];

struct zigbee_app_info {
  bool has_init;
  struct ZigBeeT *zb;
  enum ZbStatusCodeT join_status;
  uint32_t join_delay;
  
  struct ZbZclClusterT *pollcontrol_client;
};
static struct zigbee_app_info zigbee_app_info;

static struct ZbZclPollControlClientCallbackT ZbZclPollControlClientCallbacks = {
  .checkin_rsp_callback = APP_ZIGBEE_PollControl_Client_CheckinRsp_cb,
};

static struct ZbZclAddrInfoT currentServer_FastPollStarted_dstInfo;

/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  Poll Control client Checkin response callback
 * @param  clusterPtr: ZCL cluster pointer
 * @param  rsp_info: Checkin response
 * @param  srcInfo: sender address info
 * @param  arg: passed arguments
 * @retval ZCL status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_PollControl_Client_CheckinRsp_cb(struct ZbZclClusterT *clusterPtr,
                                                                       struct zcl_poll_checkin_rsp_t *rsp_info, 
                                                                       struct ZbZclAddrInfoT *srcInfo, void *arg){
  /* Check response status */                                                        
  if(rsp_info->status != ZCL_STATUS_SUCCESS){   
    APP_DBG("Error, checkin request failed.");
    return ZCL_STATUS_SUCCESS;
  }
  
  /* If device entered in Fast Poll, do remote operations on it */
  if(rsp_info->start_fast_poll){
    APP_DBG("[POLL CONTROL] Device with nwk address 0x%04x entered in fast poll for %d seconds.\n", 
            srcInfo->addr.nwkAddr, rsp_info->fast_poll_timeout/4);
    memset(&currentServer_FastPollStarted_dstInfo, 0, sizeof(currentServer_FastPollStarted_dstInfo));
    currentServer_FastPollStarted_dstInfo = *srcInfo;
    UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_APP_POLL_CONTROL_REMOTE_WRITE, CFG_SCH_PRIO_0);
  }
  
  return ZCL_STATUS_SUCCESS;
}

/**
 * @brief  Device generic command response callback
 * @param  zcl_rsp: ZCL response
 * @param  arg: passed arguments
 * @retval None
 */
static void APP_ZIGBEE_Generic_Cmd_Rsp_cb(struct ZbZclCommandRspT *zcl_rsp, void *arg){
  UNUSED(arg);
  
