STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_PollControl_Client_Coord/STM32_WPAN/App/app_zigbee.c
  /* Checking response consistency */
  assert(zcl_rsp != NULL);
  
  switch(zcl_rsp->hdr.frameCtrl.frameType){
    case ZCL_FRAMETYPE_PROFILE:
      /* general frame cmd response */   
      
      switch(zcl_rsp->hdr.cmdId){
        case ZCL_COMMAND_DEFAULT_RESPONSE:
          /* general default response */
          if (zcl_rsp->status != ZCL_STATUS_SUCCESS) {
            APP_DBG("Default response: the server returned an error: 0x%02x.\n", zcl_rsp->status);
          } else {
            APP_DBG("Default response received: success!\n");
            UTIL_SEQ_SetEvt(EVENT_ZIGBEE_CONTINUE);
          }
         break;
         
         default:
          APP_DBG("Error: unsupported general cmd type.\n");
          break;
      }
      break;
      
    default:
      APP_DBG("Error: unsupported frame type.\n");
      break;
  }
} /* APP_ZIGBEE_Generic_Cmd_Rsp_cb */

/**
 * @brief  Enable Fast Polling for servers present on the network
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_PollControl_Client_SetCheckInRspForServers(void){
  enum ZbStatusCodeT ZB_status = ZB_NWK_STATUS_SUCCESS;
  enum ZclStatusCodeT ZCL_status;
  struct ZbZclPollControlClientCheckinInfo info;
  struct ZbNwkNeighborT currentEntry;
  uint32_t index = 0;
  
  /* Enable Fast Polling period for associated devices
     => iterate over the Neighboor Table */
  
  while(ZB_status == ZB_NWK_STATUS_SUCCESS){
     memset(&info, 0, sizeof(info));
           
     /* Get the next entry in the binding table. */
     ZB_status = ZbNwkGetIndex(zigbee_app_info.zb, ZB_NWK_NIB_ID_NeighborTable, &currentEntry, sizeof(currentEntry), index);

     if(ZB_status == ZB_NWK_STATUS_SUCCESS){
       info.dst.mode = ZB_APSDE_ADDRMODE_SHORT;
       info.dst.nwkAddr = currentEntry.nwkAddr;
       info.start_fast_poll = true;
       info.fast_poll_timeout = SERVER_FAST_POLL_TIMEOUT;
       ZCL_status = zcl_poll_client_set_checkin_rsp(zigbee_app_info.pollcontrol_client, &info);
       if(ZCL_status != ZCL_STATUS_SUCCESS){
         APP_DBG("[POLL CONTROL] Error zcl_poll_client_set_checkin_rsp failed.");
       }
        
       APP_DBG("[POLL CONTROL] Fast Polling possible for device with nwk address 0x%04x.", info.dst.nwkAddr);
     }
     
     index++;
   }
}

/**
 * @brief  Remote operations on a Poll Control during its Fast Pulling period
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_PollControl_Client_OperateOnRemoteServer(void){
  enum ZclStatusCodeT status;
  struct ZbZclPollControlClientSetLongReq long_req;
  struct ZbZclPollControlClientSetShortReq short_req;
  struct ZbZclAddrInfoT dstInfo = currentServer_FastPollStarted_dstInfo;
  ZbZclWriteReqT RemoteWriteReq;
  uint32_t checkin_interval_val = SERVER_CHECKIN_INTERVAL;
  uint16_t fast_poll_timeout_val = SERVER_FAST_POLL_TIMEOUT;
  
  APP_DBG("[POLL CONTROL] Modifying Poll Control attributes for device with nwk address 0x%04x.", 
          dstInfo.addr.nwkAddr);
  
  /* Poll Control Server attributes remote write */
  memset(&RemoteWriteReq, 0, sizeof(RemoteWriteReq));
  RemoteWriteReq.dst.mode = ZB_APSDE_ADDRMODE_SHORT;
  RemoteWriteReq.dst.endpoint = SW1_ENDPOINT;
  RemoteWriteReq.dst.nwkAddr = dstInfo.addr.nwkAddr;
  
  /* remotely write two attribute with the same request */
  RemoteWriteReq.count = 2;
  
  /* ZCL_POLL_CHECK_IN_INTERVAL attribute */
  RemoteWriteReq.attr[0].attrId = ZCL_POLL_CHECK_IN_INTERVAL; 
  RemoteWriteReq.attr[0].type = ZCL_DATATYPE_UNSIGNED_32BIT;
  RemoteWriteReq.attr[0].length = 4;
  RemoteWriteReq.attr[0].value = (uint8_t const*)&checkin_interval_val;
  
  /* ZCL_POLL_SERVER_FAST_POLL_TIMEOUT attribute */
  RemoteWriteReq.attr[1].attrId = ZCL_POLL_FAST_POLL_TIMEOUT; 
  RemoteWriteReq.attr[1].type = ZCL_DATATYPE_UNSIGNED_16BIT;
  RemoteWriteReq.attr[1].length = 2;
  RemoteWriteReq.attr[1].value = (uint8_t const*)&fast_poll_timeout_val;
  APP_DBG("[POLL CONTROL] Remotely writing WR server attributes: Check-in Interval and Fast Poll Timeout.");
  
  status = ZbZclWriteReq(zigbee_app_info.pollcontrol_client, &RemoteWriteReq, 
                         APP_ZIGBEE_Remote_Write_cb, NULL);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("[POLL CONTROL] Error writing remote attribute.");
    return;
  }
  
  /* Waiting until previous commamd finishes */
  UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_CONTINUE);
  
  /* Sending Poll Control Client request for writing R-only ZCL_POLL_SERVER_SHORT_POLL_INTERVAL */
  APP_DBG("[POLL CONTROL] Sending request for writing R-only Short Poll interval attribute.");
  memset(&short_req, 0, sizeof(short_req));
  short_req.dst.mode = ZB_APSDE_ADDRMODE_SHORT;
  short_req.dst.nwkAddr = dstInfo.addr.nwkAddr;
  short_req.dst.endpoint = SW1_ENDPOINT;
  short_req.interval = SERVER_SHORT_POLL_INTERVAL;
  status = zcl_poll_client_set_short_intvl_req(zigbee_app_info.pollcontrol_client, &short_req, 
                                               APP_ZIGBEE_Generic_Cmd_Rsp_cb, NULL);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error, zcl_poll_client_set_short_intvl_req failed.");
    return;
  }
  
  /* Waiting until previous commamd finishes */
  UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_CONTINUE);
  
  /* Sending Poll Control Client request for writing R-only ZCL_POLL_SERVER_LONG_POLL_INTERVAL */
  APP_DBG("[POLL CONTROL] Sending request for writing R-only Long Poll interval attribute.");
  memset(&long_req, 0, sizeof(long_req));
  long_req.dst.mode = ZB_APSDE_ADDRMODE_SHORT;
  long_req.dst.nwkAddr = dstInfo.addr.nwkAddr;
  long_req.dst.endpoint = SW1_ENDPOINT;
  long_req.interval = SERVER_LONG_POLL_INTERVAL;
  status = zcl_poll_client_set_long_intvl_req(zigbee_app_info.pollcontrol_client, &long_req, 
                                              APP_ZIGBEE_Generic_Cmd_Rsp_cb, NULL);
  if(status != ZCL_STATUS_SUCCESS){
    APP_DBG("Error, zcl_poll_client_set_long_intvl_req failed.");
    return;
  }
 
  /* Waiting until previous commamd finishes */
  UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_CONTINUE);
  
  APP_DBG("[POLL CONTROL] Remote operations on device done during its Fast Pulling time.\n");
}

/**
 * @brief  Poll Control client initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_PollControl_Client_Init(void){
  APP_DBG("[POLL CONTROL] Poll Control client init done!\n");  
} /* APP_ZIGBEE_PollControl_Client_Init */

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_App_Init(void){
  /* Task associated with Fast Poll set checkin response */
  UTIL_SEQ_RegTask(1U << CFG_TASK_ZIGBEE_APP_POLL_CONTROL_SET_CHECKIN_RSP, 
                   UTIL_SEQ_RFU, APP_ZIGBEE_PollControl_Client_SetCheckInRspForServers);
  
  /* Task associated with remote Poll Control attributes modification */
  UTIL_SEQ_RegTask(1U << CFG_TASK_ZIGBEE_APP_POLL_CONTROL_REMOTE_WRITE, 
                   UTIL_SEQ_RFU, APP_ZIGBEE_PollControl_Client_OperateOnRemoteServer);
  
  /* Initialize Zigbee Poll Control Client parameters */
  APP_ZIGBEE_PollControl_Client_Init();
} /* APP_ZIGBEE_App_Init */

static void APP_ZIGBEE_Remote_Write_cb(const ZbZclWriteRspT *writeResp, void *cb_arg){
   UNUSED(cb_arg);
   
